/**
 *
 *                                                      Избегать предупреждений
 *                                                        о непроверенном коде.
 * Программируя с ипользованием дженериков, мы поначалу постояннуо будем сталкиваться с различными предупреждениями
 * компилятора: о непроверенной передаче, о непроверенном запуске метода, о непроверенном создании обобщенного массива
 * и т. д. Многих из этих предупреждений можно легко избежать. И очень важно избежать как можно большего количества
 * предупреждений. Если же мы уверенны, что варнинг безоснователен, то помечаем кусок кода аннотацией
 * @SupressWarnings("unchecked"). Очень важно использовать эту аннотацию на как можно меньшем диапазоне: декларировнаие
 * переменной, короткий метод или конструктор.
 *
 *
 * */

package ch5.article24;

public class AvoidWarnings {
}
